config/cf/Catalogs/TelegramКоманды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>TelegramКоманды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.TelegramБоты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименитьОстальныеКоманды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящийТекстИ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.TelegramВидыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВходящийТекстИЛИ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.TelegramВидыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.TelegramДействия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УсловияИ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.TelegramУсловия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УсловияИЛИ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.TelegramУсловия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/TelegramВидыСравнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>TelegramВидыСравнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Больше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БольшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Меньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеньшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачинаетсяС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗаполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНачинаетсяС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодобно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСодержит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подобно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Равно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Содержит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/TelegramКоманды/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Активность = Истина;
		Объект.ПрименитьОстальныеКоманды = Истина;
	КонецЕсли;
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВходящийТекстИ

&НаКлиенте
Процедура ВходящийТекстИПриАктивизацииСтроки(Элемент)
	
	ОбновитьДоступностьСтолбцаЗначениеТаблицыВходящегоТекста("ВходящийТекстИ");
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящийТекстИВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВходящийТекстИ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("Перечисление.TelegramВидыСравнения.Заполнено")
		ИЛИ ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("Перечисление.TelegramВидыСравнения.НеЗаполнено") Тогда
		
		ТекущиеДанные.Значение = "";
		
	КонецЕсли;
	
	ОбновитьДоступностьСтолбцаЗначениеТаблицыВходящегоТекста("ВходящийТекстИ");
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящийТекстИПослеУдаления(Элемент)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящийТекстИПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияИПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияИПослеУдаления(Элемент)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВходящийТекстИЛИ

&НаКлиенте
Процедура ВходящийТекстИЛИПриАктивизацииСтроки(Элемент)
	
	ОбновитьДоступностьСтолбцаЗначениеТаблицыВходящегоТекста("ВходящийТекстИЛИ");
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящийТекстИЛИВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВходящийТекстИЛИ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("Перечисление.TelegramВидыСравнения.Заполнено")
		ИЛИ ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("Перечисление.TelegramВидыСравнения.НеЗаполнено") Тогда
		
		ТекущиеДанные.Значение = "";
		
	КонецЕсли;
	
	ОбновитьДоступностьСтолбцаЗначениеТаблицыВходящегоТекста("ВходящийТекстИЛИ");	
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящийТекстИЛИПослеУдаления(Элемент)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящийТекстИЛИПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияИЛИПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
		
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияИЛИПослеУдаления(Элемент)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДоступностьСтолбцаЗначениеТаблицыВходящегоТекста(Знач ИмяТаблицы)
	
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы[ИмяТаблицы + "Значение"].Доступность = ЗначениеЗаполнено(ТекущиеДанные.ВидСравнения)
		И ТекущиеДанные.ВидСравнения <> ПредопределенноеЗначение("Перечисление.TelegramВидыСравнения.Заполнено")
		И ТекущиеДанные.ВидСравнения <> ПредопределенноеЗначение("Перечисление.TelegramВидыСравнения.НеЗаполнено");
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступность()
	
	Элементы.СтраницаВходящийТекстИ.Заголовок = НСтр("ru = 'Условия И'");
	Если Объект.ВходящийТекстИ.Количество() + Объект.УсловияИ.Количество() > 0 Тогда
		Элементы.СтраницаВходящийТекстИ.Заголовок = Элементы.СтраницаВходящийТекстИ.Заголовок
			+ " (" + Формат(Объект.ВходящийТекстИ.Количество(), "ЧРД=; ЧРГ=; ЧН=0; ЧГ=") + "+"
			+ Формат(Объект.УсловияИ.Количество(), "ЧРД=; ЧРГ=; ЧН=0; ЧГ=") + ")"
	КонецЕсли;
	
	Элементы.СтраницаВходящийТекстИЛИ.Заголовок = НСтр("ru = 'Условия ИЛИ'");
	Если Объект.ВходящийТекстИЛИ.Количество() + Объект.УсловияИЛИ.Количество() > 0 Тогда
		Элементы.СтраницаВходящийТекстИЛИ.Заголовок = Элементы.СтраницаВходящийТекстИЛИ.Заголовок
			+ " (" + Формат(Объект.ВходящийТекстИЛИ.Количество(), "ЧРД=; ЧРГ=; ЧН=0; ЧГ=") + "+"
			+ Формат(Объект.УсловияИЛИ.Количество(), "ЧРД=; ЧРГ=; ЧН=0; ЧГ=") + ")"
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
